
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/yuita-yoshihiko/aws-ecs-terraform/actions/runs/5827122808)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06b8f27414d1cabf8]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07392b2be2d18bf9c]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0f0f5a7e5cce06140]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0a8087efaf3b54d8d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00f719498d88461c4]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0480925e51e99cc7a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08194cb55181a78fe]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a7f1b532514522c6]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f92484e7b5c3bc3d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-010c2c0524b144700]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b80ac677bb33214f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0edd855a902645cb0]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01957416a0ca6bf21]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04f73d7f394b158f8]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0cef5de48e279d15c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e0b546d722c0f501]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0a33747bcbdddeb0b]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0daa3d3bd23fdf220]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00f719498d88461c41080289494]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-022cca83687a69979]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-070a6a32772284545]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0480925e51e99cc7a1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-08194cb55181a78fe1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-06b8f27414d1cabf8"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-06b8f27414d1cabf8"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 3s [id=sg-09dad8cc25e0acaa1]
aws_security_group.alb: Creation complete after 3s [id=sg-0a9d386fe1969d674]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-3202176488]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"c95f5be4146acdba471d6f2dbae690b71fd43814","Vars":{},"WorkflowName":"Terraform"} -->